configs/runs/imitation_round_feedback/hidden_bench_imitation_round_feedback_qwen_first_llm_pilot_grid_D_no_control.yaml
# First LLM pilot — Grid D no-control baseline.
#
# This is the uncontrolled companion to
# hidden_bench_imitation_round_feedback_qwen_first_llm_pilot_grid_D.yaml.
# It keeps the model, prompt, game, tasks, social-group sizes, seeds, and
# repetitions fixed, but uses `control.mechanism: none`. With no controller,
# neither controller target nor intervention budget defines an experimental
# condition, so those two axes are absent from the grid.
#
# The Cartesian grid is task={evacuation,lab-theft,datacenter} x q={1,2}:
# 6 cells (40 repetitions per cell, 240 episodes total).
#
# MODEL: this pilot runs gwdg/openai-gpt-oss-120b. The file name retains
# `qwen` to match the existing pilot-grid naming convention.
#
# RUN FROM THE REPOSITORY ROOT
#
# Preflight before model inference:
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment preflight \
#     --config configs/runs/imitation_round_feedback/hidden_bench_imitation_round_feedback_qwen_first_llm_pilot_grid_D_no_control.yaml \
#     --output-dir results/inspection/first_llm_pilot_grid_D_no_control_preflight
#
# Launch with live console output:
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment run \
#     --config configs/runs/imitation_round_feedback/hidden_bench_imitation_round_feedback_qwen_first_llm_pilot_grid_D_no_control.yaml \
#     --output-dir results
#
# Save the same console output instead:
#   mkdir -p logs
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment run \
#     --config configs/runs/imitation_round_feedback/hidden_bench_imitation_round_feedback_qwen_first_llm_pilot_grid_D_no_control.yaml \
#     --output-dir results 2>&1 | tee logs/first_llm_pilot_grid_D_no_control.log

llm_provider:
  type: university
  model: gwdg/openai-gpt-oss-120b
  credentials_env: POTSDAM_API_KEY
  base_url_env: BASE_POTSDAM_LLM_URL
  timeout_seconds: 180
  max_retries: 2
  request_concurrency: 4
  temperature: 0.0
  # gpt-oss emits reasoning_content and the answer inside this shared budget.
  # The budget guard reserves the ceiling and settles against actual usage.
  max_output_tokens: 4096
  options:
    estimated_latency_seconds: 10.0

prompt:
  schema_version: 2
  prompt_family: hidden_bench_public_ballot
  prompt_version: 1
  response_contract:
    type: hidden_bench_public_ballot

game:
  type: hidden_bench_imitation_round_feedback
  population_size: 24
  horizon: 10
  topology: complete
  options:
    task_set: expanded
    task_id: evacuation_north_hill
    profile: hidden
    assignment_scheme: paraphrased_replication
    population_preparation:
      auto_build_missing: true
      paraphrase_annotations: data/hidden_bench/annotations/paraphrases.json
    dynamics_mode: reasoning
    rounds: 10
    social_group_size: 1
    vote_visibility: public
    memory_size: 0
    allow_relay: true
    prompt_version: 1
    inform_asymmetry: false
    scenario_variant: 1
    stop_on_consensus: false
    invalid_response_retries: 1
    expected_validation_failure_rate: 0.05
    initialization:
      mode: uniform_random
    classical:
      # This names the classical comparison kernel; it does not enable control.
      kernel: controlled_imitation_round_reference

# Explicit no-op controller. It emits no controller action, takes no sensor
# sample, and controls no population positions.
control:
  mechanism: none

execution:
  seed: 20260813
  repetitions: 40
  parallelism: 40
  fail_fast: true

pricing:
  mode: live
  max_age_seconds: 600
  require_fresh_at_launch: true
  fallback_policy: deny
  explicit_unknown_price_override: false

budget:
  accounting_unit: proxy_accounting_unit
  system_max_cost_per_run: 300.0
  max_cost_per_run: 300.0
  max_provider_requests: 600000
  max_input_tokens: 1000000000
  max_output_tokens: 100000000
  allow_unbounded_paid_requests: false

logging:
  level: INFO
  console: true
  audit: true
  comet: true
  options:
    comet_project: mas-cc
    prompt_examples:
      count: 1
      scope: cell

storage:
  output_dir: results
  format: jsonl
  artifact_profile: results_only
  checkpoint_mode: episode
  overwrite: false

# The round-feedback analyzer intentionally emits no controller estimates for
# no-control rows; behavioral trajectories and m_truth remain available through
# the ordinary metrics and aggregation outputs below.
analysis:
  enabled: true
  estimators:
    - round_sensing_mi
    - round_target_actuation_cmi
    - round_truth_actuation_cmi
    - round_controller_action_entropy
    - round_controller_action_entropy_given_population
    - round_target_information_fraction
    - round_dual_action_state_fraction
    - round_dual_action_event_fraction
    - round_single_action_slice_fraction
    - round_conditioning_state_count
    - round_singleton_fraction
    - round_target_signed_actuation
    - round_truth_signed_actuation
    - round_sensor_mae
    - round_sensor_mse
  options:
    bootstrap_resamples: 1000
    null_permutations: 1000
    confidence: 0.95
    seed: 20260813
    per_cell_reports: true
  comet_export: true

metrics:
  enabled: true
  comet_export: []

aggregation:
  schema_version: 1
  forward_fill: absorbing
  relabel_by_winner: false
  percentiles: [10, 50, 90]
  rolling_window: 1
  cell_metrics: [m_ctrl, m_truth, m_order, dominant_action_share]
  sweep_metrics: []
  horizons: [1]
  null_permutations: 0

observability:
  schema_version: 1
  comet:
    writer: master_only
    heartbeat_seconds: 20
    progress_metrics: [episodes_done]
    grid_image_every_n_episodes: 10
    sweep_experiment: true
    cell_reporting: master
    metric_plots: true

experiment:
  name: hidden-bench-round-feedback-gpt-oss-120b-first-llm-pilot-grid-D-no-control
  description: Uncontrolled Grid D baseline across three tasks and two social-group sizes.
  tags: [hidden-bench, imitation, round-feedback, gpt-oss-120b, first-llm-pilot, grid-D, no-control]
  metadata:
    pilot_grid: D-no-control
    population_rounds: 10
    social_group_sizes: [1, 2]
    control_mechanism: none
    tasks: [evacuation_north_hill, Laboratory Theft Deduction, datacenter_emergency_migration]

grid:
  # Task labels: `evacuation_north_hill` is a corpus name; the other two are
  # corpus task ids 13 and 36 given by name for readable reports.
  game.options.task_id:
    - evacuation_north_hill
    - "Laboratory Theft Deduction"
    - datacenter_emergency_migration
  game.options.social_group_size: [1, 2]